src/main/java/ru/vk/itmo/test/tveritinalexandr/reports/step_2/wrk2/put_wrk2_output
tveritinaleksandr@Tveritins-MacBook-Pro wrk2-arm % ./wrk -d 25 -t 1 -c 32 -R 65000 -L -s /Users/tveritinaleksandr/IdeaProjects/2024-highload-dht/src/main/java/ru/vk/itmo/test/tveritinalexandr/lua/put_rquest.lua http://localhost:8080
Running 25s test @ http://localhost:8080
  1 threads and 32 connections
  Thread calibration: mean lat.: 335.459ms, rate sampling interval: 1051ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   978.66ms  260.60ms   1.48s    56.77%
    Req/Sec    61.37k     1.17k   63.70k    57.14%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  977.92ms
 75.000%    1.20s
 90.000%    1.34s
 99.000%    1.44s
 99.900%    1.47s
 99.990%    1.47s
 99.999%    1.48s
100.000%    1.48s

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     541.183     0.000000            7         1.00
     615.935     0.100000        91731         1.11
     692.223     0.200000       182201         1.25
     805.887     0.300000       273201         1.43
     895.487     0.400000       364175         1.67
     977.919     0.500000       454938         2.00
    1018.879     0.550000       500509         2.22
    1058.815     0.600000       546444         2.50
    1104.895     0.650000       591701         2.86
    1147.903     0.700000       636823         3.33
    1201.151     0.750000       682550         4.00
    1226.751     0.775000       705674         4.44
    1250.303     0.800000       728349         5.00
    1272.831     0.825000       750744         5.71
    1294.335     0.850000       773520         6.67
    1317.887     0.875000       796057         8.00
    1331.199     0.887500       807678         8.89
    1344.511     0.900000       818730        10.00
    1358.847     0.912500       830030        11.43
    1372.159     0.925000       842179        13.33
    1383.423     0.937500       853507        16.00
    1388.543     0.943750       858670        17.78
    1393.663     0.950000       864348        20.00
    1398.783     0.956250       870063        22.86
    1405.951     0.962500       876390        26.67
    1411.071     0.968750       881460        32.00
    1414.143     0.971875       884153        35.56
    1418.239     0.975000       887435        40.00
    1421.311     0.978125       890276        45.71
    1424.383     0.981250       892526        53.33
    1428.479     0.984375       895439        64.00
    1431.551     0.985938       897296        71.11
    1433.599     0.987500       898812        80.00
    1435.647     0.989062       900177        91.43
    1437.695     0.990625       901164       106.67
    1440.767     0.992188       902730       128.00
    1441.791     0.992969       903188       142.22
    1443.839     0.993750       903974       160.00
    1445.887     0.994531       904632       182.86
    1447.935     0.995313       905347       213.33
    1449.983     0.996094       906108       256.00
    1451.007     0.996484       906510       284.44
    1452.031     0.996875       906917       320.00
    1453.055     0.997266       907277       365.71
    1454.079     0.997656       907528       426.67
    1455.103     0.998047       907816       512.00
    1456.127     0.998242       908024       568.89
    1458.175     0.998437       908241       640.00
    1459.199     0.998633       908346       731.43
    1462.271     0.998828       908530       853.33
    1465.343     0.999023       908694      1024.00
    1466.367     0.999121       908834      1137.78
    1467.391     0.999219       908951      1280.00
    1468.415     0.999316       909118      1462.86
    1468.415     0.999414       909118      1706.67
    1469.439     0.999512       909248      2048.00
    1469.439     0.999561       909248      2275.56
    1469.439     0.999609       909248      2560.00
    1470.463     0.999658       909316      2925.71
    1470.463     0.999707       909316      3413.33
    1471.487     0.999756       909376      4096.00
    1471.487     0.999780       909376      4551.11
    1472.511     0.999805       909440      5120.00
    1472.511     0.999829       909440      5851.43
    1473.535     0.999854       909471      6826.67
    1473.535     0.999878       909471      8192.00
    1474.559     0.999890       909485      9102.22
    1475.583     0.999902       909496     10240.00
    1476.607     0.999915       909509     11702.86
    1476.607     0.999927       909509     13653.33
    1477.631     0.999939       909524     16384.00
    1478.655     0.999945       909535     18204.44
    1478.655     0.999951       909535     20480.00
    1479.679     0.999957       909547     23405.71
    1479.679     0.999963       909547     27306.67
    1479.679     0.999969       909547     32768.00
    1480.703     0.999973       909559     36408.89
    1480.703     0.999976       909559     40960.00
    1480.703     0.999979       909559     46811.43
    1480.703     0.999982       909559     54613.33
    1481.727     0.999985       909572     65536.00
    1481.727     0.999986       909572     72817.78
    1481.727     0.999988       909572     81920.00
    1481.727     0.999989       909572     93622.86
    1481.727     0.999991       909572    109226.67
    1481.727     0.999992       909572    131072.00
    1481.727     0.999993       909572    145635.56
    1481.727     0.999994       909572    163840.00
    1481.727     0.999995       909572    187245.71
    1481.727     0.999995       909572    218453.33
    1481.727     0.999996       909572    262144.00
    1481.727     0.999997       909572    291271.11
    1481.727     0.999997       909572    327680.00
    1481.727     0.999997       909572    374491.43
    1481.727     0.999998       909572    436906.67
    1482.751     0.999998       909574    524288.00
    1482.751     1.000000       909574          inf
#[Mean    =      978.656, StdDeviation   =      260.601]
#[Max     =     1481.728, Total count    =       909574]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1527117 requests in 25.00s, 97.58MB read
Requests/sec:  61085.94
Transfer/sec:      3.90MB
tveritinaleksandr@Tveritins-MacBook-Pro wrk2-arm % ./wrk -d 25 -t 1 -c 32 -R 65000 -L -s /Users/tveritinaleksandr/IdeaProjects/2024-highload-dht/src/main/java/ru/vk/itmo/test/tveritinalexandr/lua/put_rquest.lua http://localhost:8080
Running 25s test @ http://localhost:8080
  1 threads and 32 connections
  Thread calibration: mean lat.: 326.532ms, rate sampling interval: 1137ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.05s   218.80ms   1.40s    57.93%
    Req/Sec    61.79k     1.35k   64.37k    69.23%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.08s
 75.000%    1.25s
 90.000%    1.31s
 99.000%    1.36s
 99.900%    1.39s
 99.990%    1.39s
 99.999%    1.40s
100.000%    1.40s

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     598.015     0.000000            3         1.00
     718.335     0.100000        91962         1.11
     808.447     0.200000       183705         1.25
     913.919     0.300000       275419         1.43
     991.231     0.400000       366690         1.67
    1084.415     0.500000       458324         2.00
    1124.351     0.550000       504623         2.22
    1163.263     0.600000       550307         2.50
    1196.031     0.650000       595775         2.86
    1222.655     0.700000       642659         3.33
    1247.231     0.750000       688647         4.00
    1257.471     0.775000       710278         4.44
    1270.783     0.800000       734967         5.00
    1278.975     0.825000       758145         5.71
    1287.167     0.850000       781651         6.67
    1296.383     0.875000       802134         8.00
    1301.503     0.887500       815208         8.89
    1305.599     0.900000       827331        10.00
    1310.719     0.912500       837604        11.43
    1317.887     0.925000       847777        13.33
    1325.055     0.937500       861166        16.00
    1327.103     0.943750       866725        17.78
    1329.151     0.950000       871793        20.00
    1331.199     0.956250       876454        22.86
    1334.271     0.962500       882445        26.67
    1338.367     0.968750       888350        32.00
    1340.415     0.971875       891256        35.56
    1342.463     0.975000       894095        40.00
    1344.511     0.978125       896498        45.71
    1348.607     0.981250       899979        53.33
    1354.751     0.984375       902250        64.00
    1357.823     0.985938       904131        71.11
    1359.871     0.987500       905613        80.00
    1360.895     0.989062       906385        91.43
    1362.943     0.990625       907843       106.67
    1364.991     0.992188       909249       128.00
    1367.039     0.992969       910177       142.22
    1370.111     0.993750       910727       160.00
    1377.279     0.994531       911454       182.86
    1383.423     0.995313       912176       213.33
    1385.471     0.996094       912858       256.00
    1386.495     0.996484       913347       284.44
    1387.519     0.996875       913841       320.00
    1388.543     0.997266       914309       365.71
    1388.543     0.997656       914309       426.67
    1389.567     0.998047       914732       512.00
    1390.591     0.998242       915086       568.89
    1390.591     0.998437       915086       640.00
    1391.615     0.998633       915486       731.43
    1391.615     0.998828       915486       853.33
    1392.639     0.999023       915825      1024.00
    1392.639     0.999121       915825      1137.78
    1392.639     0.999219       915825      1280.00
    1392.639     0.999316       915825      1462.86
    1393.663     0.999414       916121      1706.67
    1393.663     0.999512       916121      2048.00
    1393.663     0.999561       916121      2275.56
    1393.663     0.999609       916121      2560.00
    1393.663     0.999658       916121      2925.71
    1394.687     0.999707       916306      3413.33
    1394.687     0.999756       916306      4096.00
    1394.687     0.999780       916306      4551.11
    1394.687     0.999805       916306      5120.00
    1394.687     0.999829       916306      5851.43
    1394.687     0.999854       916306      6826.67
    1394.687     0.999878       916306      8192.00
    1394.687     0.999890       916306      9102.22
    1395.711     0.999902       916382     10240.00
    1395.711     0.999915       916382     11702.86
    1395.711     0.999927       916382     13653.33
    1395.711     0.999939       916382     16384.00
    1395.711     0.999945       916382     18204.44
    1395.711     0.999951       916382     20480.00
    1395.711     0.999957       916382     23405.71
    1395.711     0.999963       916382     27306.67
    1395.711     0.999969       916382     32768.00
    1395.711     0.999973       916382     36408.89
    1395.711     0.999976       916382     40960.00
    1395.711     0.999979       916382     46811.43
    1395.711     0.999982       916382     54613.33
    1396.735     0.999985       916398     65536.00
    1396.735     1.000000       916398          inf
#[Mean    =     1046.898, StdDeviation   =      218.803]
#[Max     =     1395.712, Total count    =       916398]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1531693 requests in 25.00s, 97.87MB read
Requests/sec:  61270.16
Transfer/sec:      3.91MB